In [1]:
import pandas as pd
import numpy as np

In [2]:
series = pd.Series(np.random.randint(4, size=6))

In [3]:
series

0    2
1    2
2    3
3    0
4    1
5    1
dtype: int64

In [4]:
series.apply(np.sqrt)

0    1.414214
1    1.414214
2    1.732051
3    0.000000
4    1.000000
5    1.000000
dtype: float64

In [5]:
series.apply(np.average)

0    2.0
1    2.0
2    3.0
3    0.0
4    1.0
5    1.0
dtype: float64

In [6]:
df = pd.DataFrame({'One' : [1,2,3,4,5],
                  'Two' : [6,7,8,9,10],
                  'Three' : [11,12,13,14,15]})

In [7]:
df

   One  Two  Three
0    1    6     11
1    2    7     12
2    3    8     13
3    4    9     14
4    5   10     15

In [8]:
df.apply(np.sqrt, axis=1)

        One       Two     Three
0  1.000000  2.449490  3.316625
1  1.414214  2.645751  3.464102
2  1.732051  2.828427  3.605551
3  2.000000  3.000000  3.741657
4  2.236068  3.162278  3.872983

In [9]:
df.apply(np.sqrt, axis=0)

        One       Two     Three
0  1.000000  2.449490  3.316625
1  1.414214  2.645751  3.464102
2  1.732051  2.828427  3.605551
3  2.000000  3.000000  3.741657
4  2.236068  3.162278  3.872983

In [10]:
df.apply(np.average, axis=0)

One       3.0
Two       8.0
Three    13.0
dtype: float64

In [11]:
df.apply(np.average, axis=1)

0     6.0
1     7.0
2     8.0
3     9.0
4    10.0
dtype: float64

In [15]:
import math 

def get_sum(df):
    return math.ceil((df['One'] + df['Two']) / 3)

In [18]:
df.apply(get_sum, axis=1)

0    3
1    3
2    4
3    5
4    5
dtype: int64

In [21]:
df.apply(lambda x : x * 2, axis=1)

   One  Two  Three
0    2   12     22
1    4   14     24
2    6   16     26
3    8   18     28
4   10   20     30

In [22]:
df.apply(lambda x : [1,2], result_type='expand', axis=1)

   0  1
0  1  2
1  1  2
2  1  2
3  1  2
4  1  2

In [23]:
df.apply(lambda x : [1,2], result_type='reduce', axis=1)

0    [1, 2]
1    [1, 2]
2    [1, 2]
3    [1, 2]
4    [1, 2]
dtype: object

In [26]:
df.apply(lambda x : [1,2,3], axis=1, result_type='broadcast')

   One  Two  Three
0    1    2      3
1    1    2      3
2    1    2      3
3    1    2      3
4    1    2      3

In [27]:
df.apply(lambda x : 1, axis=1, result_type='broadcast')

   One  Two  Three
0    1    1      1
1    1    1      1
2    1    1      1
3    1    1      1
4    1    1      1